* Qiitaの記事を全部引っ越ししている [WIP]
  :PROPERTIES:
  :DATE: [2021-11-22 Mon 22:55]
  :TAGS: :blog:
  :BLOG_POST_KIND: HowTo
  :BLOG_POST_PROGRESS: WIP
  :BLOG_POST_STATUS: Normal
  :END:
  :LOGBOOK:
  CLOCK: [2021-11-22 Mon 22:57]--[2021-11-23 Tue 00:59] =>  2:02
  CLOCK: [2021-11-22 Mon 22:56]--[2021-11-22 Mon 22:56] =>  0:00
  :END:
  
  長らくの間私は [[https://qiita.com/Cj-bc][Qiita]]に記事を書いていましたが、今や自分のページを持つに
  至りました。

  依然技術系の記事は別に出しても良いのですが、とりあえず
  このブログには全ての記事を載せておきたかったのでQiitaの記事を引っ越して
  こようと思います。
*** TODO 2. HTMLエンコードを外す
    
    APIから取得した ~body~ は HTMLエンコードされている(e.g. ~->~ が ~-&gt;~ になるなど)
    ので、これをデコードしてあげます。

    #+begin_waring
    /HTML エンコード/ と /URI エンコード/ は(異なります。
    #+end_waring

    多分色々な方法が色々な言語にあると思いますが、
    一番最初に思い付いた簡単かつ確実なのはnodeを使うことだったのでそうします。
    ~decodeURI~ ([[https://developer.mozilla.org/ja/docs/Web/JavaScript/Reference/Global_Objects/decodeURI][参考]]) 使えばよさそう。

    + ~console.log~ :: 標準出力に出力するために使用します
    + ~fs.readFileSync("/dev/stdin", "utf8")~ :: 標準入力から読むために使用します
    + ~decodeURI~ :: URIエンコードをデコードする関数です。
    
    #+begin_src sh
      node -e 'console.log(encodeURI("https://qiita/てすともーど!!!>"))' | node -e 'console.log(decodeURI(fs.readFileSync("/dev/stdin", "utf8")))'
    #+end_src

    #+RESULTS:
    : https://qiita/てすともーど!!!>
    
